In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({"col1": [3,4,5,np.nan], "col2": [5,np.nan, np.nan,8], "col3": [9,10,11,12]})

In [6]:
df

   col1  col2  col3
0   3.0   5.0     9
1   4.0   NaN    10
2   5.0   NaN    11
3   NaN   8.0    12

In [7]:
df.dropna(axis=1)

   col3
0     9
1    10
2    11
3    12

In [8]:
df

   col1  col2  col3
0   3.0   5.0     9
1   4.0   NaN    10
2   5.0   NaN    11
3   NaN   8.0    12

In [10]:
df.fillna(value="X")

  col1 col2  col3
0  3.0  5.0     9
1  4.0    X    10
2  5.0    X    11
3    X  8.0    12

In [11]:
df.fillna(value="Z")

  col1 col2  col3
0  3.0  5.0     9
1  4.0    Z    10
2  5.0    Z    11
3    Z  8.0    12

In [14]:
df["col1"].mean()

np.float64(4.0)

In [19]:
len(df["col3"].unique())

4

In [20]:
df["col1"].value_counts()

col1
3.0    1
4.0    1
5.0    1
Name: count, dtype: int64

In [ ]:
# Create master dataframe from different dataframes
# df = pd.concat("","","")